<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Studio 3T and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.splyt.autopkg.munki.Studio3T</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Studio3T</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/3T</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>MongoDB is easy – now make it powerful with Studio 3T. Build queries fast, generate code, import/export in multiple formats, and much more.</string>
            <key>display_name</key>
            <string>Studio 3T</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>Utilities</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.splyt.autopkg.download.Studio3T</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/Studio-3T.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
