<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Studio 3T</string>
    <key>Identifier</key>
    <string>com.splyt.autopkg.download.Studio3T</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Studio3T</string>
        <key>UPDATES_URL</key>
        <string>https://update.studio3t.com/mac/updates.xml</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.studio3t.com/studio-3t/mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.splyt.autopkg.SharedProcessors/Install4jUpdateDescriptorProvider</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%UPDATES_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%/%newVersion%/%fileName%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%fileName%/Studio 3T.app</string>
                <key>requirement</key>
                <string>identifier "com.install4j.8357-7994-5030-9105.837" and (anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SNN4BCRZGB))</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
